package com.example.weshare.databean;

import java.util.List;

/**
 * Created by: Daniel Qin
 * Date: 2016-09-12
 * Time: 14:22
 * For:
 */

public class HelpBean
{

    /**
     * list : [{"title":"售后问题联系我们","next":[{"name":"售后申请操作流程","note":"      操作流程：享享平台APP--我的享享\u2014帮助与反馈---反馈(苹果手机)或意见反馈（安卓手机）\r\n      申请售后：在商品签收24小时内，遇到商品质量问题，可通过手机APP进行质量投诉，需要上传问题商品的照片并提供申诉内容，我们将尽快与您联系，谢谢。                                                "},{"name":"微信客服","note":"      您可以通过微信添加公众号（xiangxiang_365）,由在线客服为您服务，服务时间9:00-18:00。                                "},{"name":"客服电话","note":"      如您不方便在线沟通，可以拨打客服电话联系我们。三里庵、琥珀、稻香村街道客服电话：0551-62292025；五里墩、笔架山街道客服电话：0551- 65591958；南七街道客服电话：0551- 62292010；西园、荷叶地街道客服电话：0551- 62292021。                               "}]},{"title":"订单及配送问题","next":[{"name":"订单配送时间和运费说明","note":"       ( 1 ) 订单配送时间：上午10点到晚上21点之间下单，配送时间为次日上午8:30\u201411:30；晚上21点到次日上午10点之间下单，配送时间为次日下午14:00\u201417:30；\r\n      ( 2 ) 运费说明：同个配送时间段，每笔订单实付金额不满10元收取1元配送费，满10元免收配送费；同个配送时间段多次下单（仅限注册手机号、收货地址均一致）的顾客，以实付金额累计来判断。（重复计费，多收的金额将于次日返还至享享币账户，如遇非工作日则顺延）\r\n      每日物流配送费退款明细将公布在享享论坛官方公告中，您可以前去论坛查询退款明细。如对于退款金额有异议的，请拨打客服热线：0551-65591958           "},{"name":"订单提交之后能否取消？","note":"      如果订单状态是待发货状态，则您可以点击取消订单按钮取消订单，退款会自动返还到您的享享币账户。（说明：如该订单使用优惠券，取消订单之后优惠券不返还）\r\n      如果订单状态是发货中状态，则订单无法取消，敬请谅解。      "},{"name":"享享币余额使用说明","note":"      享享币余额不够支付订单款项，又想将享享币使用完的情况下，您可以在提交订单的时候，支付方式选择享享币之外的其他付款方式（微信支付、支付宝或银联支付），选择之后在支付方式下面会出现\u201c使用享享币可抵用XX元\u201d的文字，勾选文字前面的小圆圈，即可将享享币余额使用完。       "}]},{"title":"订单及售后问题","next":[{"name":"对收到的商品不满意怎么办？","note":"      配送师傅将货送到您手中时，建议您当场打开验收，核对清单并签单，如遇到商品存在质量问题或有破损或与您订购的商品不一样，可以直接拒签该单品。\r\n      如您已经签收，在24小时售后时效内，可拨打客服电话或在帮助与反馈中反馈您遇到的问题，客服将会联系您处理。                "},{"name":"售后处理标准","note":"      为了您的利益，请收到货物后仔细清点检查您订购的商品。如商品配送有误、包装破损、产品变质和数量不对等问题，请当面及时向配送人员或电话联系享享客服提出，以便我们能尽快地为您处理。为保障您的权益，请仔细阅读以下内容：\r\n    （1）退换货品受理范围\r\n      a、请您在货品送达时认真核对收货确认单中货品（含赠品）的种类、数量和质量。如质量、数量、品牌与下单不符以及货品（不含赠品）包装破损等问题的，您可以当场提出退换货要求；\r\n      b、生鲜类货品：鲜肉禽蛋、海鲜水产、冷藏或冻货等：当场验货，我们可提供退换货的服务；水果类：自您签收货品后24小时内如发现有质量问题，我们可以提供退换货的服务;\r\n      c、非生鲜类货品：米面粮油、调料干货、厨房用品等：自您签收货品后7天内如发现有质量问题，我们可以提供退换货的服务；\r\n    （2）不在退换货业务受理范围的\r\n      a、生鲜类货品（鲜肉禽蛋、海鲜水产、冷藏或冻货等）当场验收，签收，签收后将不享受退换货服务；\r\n      b、蔬菜水果类货品在您签收货品24小时后将不在享受退换货服务；\r\n      c、非生鲜类货品（米面粮油、调料干货、厨房用品等）在您签收货品7天后将不在享受退换货服务；\r\n      1、原则上已经开封、已使用商品，将不享受退换货服务；\r\n      2、由于您下错单造成的损失，原则上由您自行承担，将不享受退换货服务；\r\n      3、由于您个人原因或保管不当造成质量问题的商品，将不享受退换货服务；\r\n    （3）退换货必要条件\r\n     退换货时，您必须出具：\r\n     1、问题货品（含赠品）；\r\n     2、收货确认单（请妥善保存您的收货单）；\r\n     3、问题货品相关问题细节足够清晰的照片；\r\n     4、问题货品相关完整的包装袋；\r\n      "}]}]
     * succeed : 1
     */

    private int succeed;
    /**
     * title : 售后问题联系我们
     * next : [{"name":"售后申请操作流程","note":"      操作流程：享享平台APP--我的享享\u2014帮助与反馈---反馈(苹果手机)或意见反馈（安卓手机）\r\n      申请售后：在商品签收24小时内，遇到商品质量问题，可通过手机APP进行质量投诉，需要上传问题商品的照片并提供申诉内容，我们将尽快与您联系，谢谢。                                                "},{"name":"微信客服","note":"      您可以通过微信添加公众号（xiangxiang_365）,由在线客服为您服务，服务时间9:00-18:00。                                "},{"name":"客服电话","note":"      如您不方便在线沟通，可以拨打客服电话联系我们。三里庵、琥珀、稻香村街道客服电话：0551-62292025；五里墩、笔架山街道客服电话：0551- 65591958；南七街道客服电话：0551- 62292010；西园、荷叶地街道客服电话：0551- 62292021。                               "}]
     */

    private List<ListBean> list;

    public int getSucceed()
    {
        return succeed;
    }

    public void setSucceed(int succeed)
    {
        this.succeed = succeed;
    }

    public List<ListBean> getList()
    {
        return list;
    }

    public void setList(List<ListBean> list)
    {
        this.list = list;
    }

    public static class ListBean
    {

        private String title;
        /**
         * name : 售后申请操作流程
         * note :       操作流程：享享平台APP--我的享享—帮助与反馈---反馈(苹果手机)或意见反馈（安卓手机）
         申请售后：在商品签收24小时内，遇到商品质量问题，可通过手机APP进行质量投诉，需要上传问题商品的照片并提供申诉内容，我们将尽快与您联系，谢谢。
         */

        private List<NextBean> next;

        public String getTitle()
        {
            return title;
        }

        public void setTitle(String title)
        {
            this.title = title;
        }

        public List<NextBean> getNext()
        {
            return next;
        }

        public void setNext(List<NextBean> next)
        {
            this.next = next;
        }

        public static class NextBean
        {

            private String name;
            private String note;

            public String getName()
            {
                return name;
            }

            public void setName(String name)
            {
                this.name = name;
            }

            public String getNote()
            {
                return note;
            }

            public void setNote(String note)
            {
                this.note = note;
            }
        }
    }
}
