package com.example.weshare.databean;

import java.io.Serializable;
import java.util.List;

/**
 * Created by: Daniel Qin
 * Date: 2016-09-08
 * Time: 10:56
 * For:
 */

public class LocationBean
{

    /**
     * area : [{"id":"2229","name":"蜀山区","index":"186"}]
     * street : [{"id":"16816","name":"三里庵街道","index":"2229"},{"id":"16817","name":"五里墩街道","index":"2229"},{"id":"16819","name":"南七里站街道","index":"2229"},{"id":"16821","name":"琥珀山庄街道","index":"2229"},{"id":"16822","name":"稻香村街道","index":"2229"},{"id":"16823","name":"笔架山街道","index":"2229"},{"id":"16824","name":"荷叶地街道","index":"2229"},{"id":"16825","name":"西园新村街道","index":"2229"}]
     * zone : [{"id":"45290","name":"安徽大学","index":"16816"},{"id":"45291","name":"安徽大学家属宿舍","index":"16816"},{"id":"45292","name":"安徽电器工程职业技术学院","index":"16816"},{"id":"45293","name":"安徽国际金融中心","index":"16816"},{"id":"45294","name":"安徽华美整形美容医院","index":"16816"},{"id":"45295","name":"安徽农业大学第一生活区","index":"16816"},{"id":"45296","name":"安徽省电力公司黄山路生活区","index":"16816"},{"id":"45297","name":"安徽省旅游局","index":"16816"},{"id":"45298","name":"安徽医科大学","index":"16816"},{"id":"45299","name":"安徽医科大学第一附属医院","index":"16816"},{"id":"45300","name":"安徽医科大学附属小学","index":"16816"},{"id":"45301","name":"安徽中医药大学东区","index":"16816"},{"id":"45302","name":"安康出租公寓","index":"16816"},{"id":"45303","name":"安医大平和苑","index":"16816"},{"id":"45304","name":"白鹭苑","index":"16816"},{"id":"45305","name":"碧雨花园","index":"16816"},{"id":"45306","name":"春天大厦","index":"16816"},{"id":"45307","name":"大众公寓","index":"16816"},{"id":"45308","name":"稻香阁","index":"16816"},{"id":"45309","name":"稻香楼宿舍","index":"16816"},{"id":"45310","name":"第四人民医院宿舍","index":"16816"},{"id":"45311","name":"国家外汇管理局安徽省分局","index":"16816"},{"id":"45312","name":"国旅大厦","index":"16816"},{"id":"45313","name":"合肥高升学习（安大东门校区）","index":"16816"},{"id":"45314","name":"合肥市第四人民医院","index":"16816"},{"id":"45315","name":"合肥市第五十中学","index":"16816"},{"id":"45316","name":"合肥市交通运输局","index":"16816"},{"id":"45317","name":"合肥永达大厦","index":"16816"},{"id":"45318","name":"合九合作化新村","index":"16816"},{"id":"45319","name":"华微家园","index":"16816"},{"id":"45320","name":"汇金大厦","index":"16816"},{"id":"45321","name":"锦江大厦","index":"16816"},{"id":"45322","name":"锦江名苑","index":"16816"},{"id":"45323","name":"静雅公寓","index":"16816"},{"id":"45324","name":"康元大厦","index":"16816"},{"id":"45325","name":"客来欣公寓","index":"16816"},{"id":"45326","name":"龙腾公寓","index":"16816"},{"id":"45327","name":"梅山新村","index":"16816"},{"id":"45328","name":"梅园公寓","index":"16816"},{"id":"45329","name":"胖姐出租公寓","index":"16816"},{"id":"45330","name":"桥南公寓","index":"16816"},{"id":"45331","name":"轻工大厦","index":"16816"},{"id":"45332","name":"瑞涛出租公寓","index":"16816"},{"id":"45333","name":"省外贸绩溪新村","index":"16816"},{"id":"45334","name":"省文联宿舍","index":"16816"},{"id":"45335","name":"蜀山区人民政府","index":"16816"},{"id":"45336","name":"水景阁","index":"16816"},{"id":"45337","name":"松涛里","index":"16816"},{"id":"45338","name":"万象新天","index":"16816"},{"id":"45339","name":"西山景区 ","index":"16816"},{"id":"45340","name":"西园出租公寓 ","index":"16816"},{"id":"45341","name":"西园南村 ","index":"16816"},{"id":"45342","name":"西园新村 ","index":"16816"},{"id":"45343","name":"兴业苑 ","index":"16816"},{"id":"45344","name":"阳光出租公寓 ","index":"16816"},{"id":"45345","name":"真善美出租公寓 ","index":"16816"},{"id":"45346","name":"中科大北校区 ","index":"16816"},{"id":"45347","name":"竹荫里","index":"16816"},{"id":"45445","name":"之心城","index":"16816"},{"id":"45446","name":"汇金大厦","index":"16816"},{"id":"45447","name":"环球中心","index":"16816"},{"id":"45448","name":"国购广场","index":"16816"},{"id":"45449","name":"科技银行大厦","index":"16816"},{"id":"45458","name":"之心城","index":"16816"},{"id":"45052","name":"颐和花园","index":"16817"},{"id":"45053","name":"凤凰城","index":"16817"},{"id":"45054","name":"庐阳佳苑","index":"16817"},{"id":"45055","name":"理想年代家园","index":"16817"},{"id":"45056","name":"虹雨花园","index":"16817"},{"id":"45057","name":"105医院宿舍","index":"16817"},{"id":"45058","name":"气象苑","index":"16817"},{"id":"45059","name":"龙居山庄","index":"16817"},{"id":"45060","name":"海亚当代","index":"16817"},{"id":"45061","name":"新景花园","index":"16817"},{"id":"45062","name":"龙凤嘉园","index":"16817"},{"id":"45063","name":"万联春晓翠庭","index":"16817"},{"id":"45064","name":"丰乐苑","index":"16817"},{"id":"45065","name":"御琴湾","index":"16817"},{"id":"45066","name":"美域花园","index":"16817"},{"id":"45067","name":"亲亲家园","index":"16817"},{"id":"45068","name":"博微花园","index":"16817"},{"id":"45069","name":"电信村小区","index":"16817"},{"id":"45070","name":"军休所","index":"16817"},{"id":"45071","name":"团安村","index":"16817"},{"id":"45072","name":"廉泉小区","index":"16817"},{"id":"45073","name":"青阳西村","index":"16817"},{"id":"45074","name":"高河花园","index":"16817"},{"id":"45075","name":"绿景家园","index":"16817"},{"id":"45076","name":"林业厅","index":"16817"},{"id":"45077","name":"江淮学院","index":"16817"},{"id":"45078","name":"樊洼路小区","index":"16817"},{"id":"45079","name":"松芝万象城","index":"16817"},{"id":"45080","name":"燕园","index":"16817"},{"id":"45081","name":"天一家园","index":"16817"},{"id":"45082","name":"黎阳嘉苑","index":"16817"},{"id":"45083","name":"淝河新村","index":"16817"},{"id":"45435","name":"紫荆广场","index":"16817"},{"id":"45436","name":"经典城市广场","index":"16817"},{"id":"45437","name":"帝豪大厦","index":"16817"},{"id":"45438","name":"江南名茶城","index":"16817"},{"id":"45439","name":"青阳新村","index":"16817"},{"id":"45440","name":"安徽省农业机械研究所","index":"16817"},{"id":"45441","name":"国瑞大厦","index":"16817"},{"id":"45460","name":"东风小区","index":"16817"},{"id":"45461","name":"安-活动现场","index":"16817"},{"id":"45495","name":"海亮熙园","index":"16817"},{"id":"45084","name":"新华·学府星座","index":"16819"},{"id":"45085","name":"省建机厂宿舍","index":"16819"},{"id":"45086","name":"九华·华林家园","index":"16819"},{"id":"45087","name":"新华·学府花园","index":"16819"},{"id":"45088","name":"邮电小区","index":"16819"},{"id":"45089","name":"绿城百合公寓","index":"16819"},{"id":"45090","name":"新华学府春天","index":"16819"},{"id":"45091","name":"上品家苑","index":"16819"},{"id":"45092","name":"红鑫新村","index":"16819"},{"id":"45093","name":"香樟雅苑","index":"16819"},{"id":"45094","name":"秀水花园","index":"16819"},{"id":"45095","name":"西城花园","index":"16819"},{"id":"45096","name":"世纪新城","index":"16819"},{"id":"45097","name":"利恒嘉苑","index":"16819"},{"id":"45098","name":"常青棉织厂住宅楼","index":"16819"},{"id":"45099","name":"化机小区","index":"16819"},{"id":"45100","name":"金环花园北村、南村","index":"16819"},{"id":"45101","name":"盛世名城·桂竹苑","index":"16819"},{"id":"45102","name":"盛世名城·丽景花园","index":"16819"},{"id":"45103","name":"北苑小区（潜山路）","index":"16819"},{"id":"45104","name":"路缘小区","index":"16819"},{"id":"45105","name":"合轻家园","index":"16819"},{"id":"45106","name":"维也纳森林花园","index":"16819"},{"id":"45107","name":"华地学府名都","index":"16819"},{"id":"45108","name":"红园小区","index":"16819"},{"id":"45109","name":"华地·学府公馆","index":"16819"},{"id":"45110","name":"蜀鑫雅苑","index":"16819"},{"id":"45111","name":"华邦光明世家","index":"16819"},{"id":"45112","name":"航鑫家苑","index":"16819"},{"id":"45113","name":"金色名郡","index":"16819"},{"id":"45114","name":"汽修厂小区","index":"16819"},{"id":"45115","name":"信旺·华府骏苑","index":"16819"},{"id":"45116","name":"黄山花园","index":"16819"},{"id":"45117","name":"南屏家园","index":"16819"},{"id":"45118","name":"华润·幸福里","index":"16819"},{"id":"45119","name":"丁香家园1期","index":"16819"},{"id":"45120","name":"丁香家园2期","index":"16819"},{"id":"45121","name":"丁香家园3期","index":"16819"},{"id":"45122","name":"丁怡花园","index":"16819"},{"id":"45123","name":"建业领翔","index":"16819"},{"id":"45124","name":"汇峰大厦","index":"16819"},{"id":"45125","name":"新华国际广场","index":"16819"},{"id":"45126","name":"港汇广场","index":"16819"},{"id":"45127","name":"华润五彩城","index":"16819"},{"id":"45128","name":"盛景国际","index":"16819"},{"id":"45129","name":"世界之窗大厦","index":"16819"},{"id":"45130","name":"博澳丽苑","index":"16819"},{"id":"45131","name":"合九新村","index":"16819"},{"id":"45132","name":"新塘家园","index":"16819"},{"id":"45133","name":"信达西山银杏","index":"16819"},{"id":"45134","name":"海雨家园","index":"16819"},{"id":"45135","name":"百合花园","index":"16819"},{"id":"45136","name":"翠宁雅苑","index":"16819"},{"id":"45137","name":"和一花园","index":"16819"},{"id":"45433","name":"和谐花园","index":"16819"},{"id":"45450","name":"金满园","index":"16819"},{"id":"45451","name":"皖岳新村","index":"16819"},{"id":"45348","name":"安徽农业大学","index":"16821"},{"id":"45349","name":"奥林花园","index":"16821"},{"id":"45350","name":"彩虹苑","index":"16821"},{"id":"45351","name":"翠竹园","index":"16821"},{"id":"45352","name":"登云庭","index":"16821"},{"id":"45353","name":"电子所","index":"16821"},{"id":"45354","name":"飞虹小区","index":"16821"},{"id":"45355","name":"翡翠园","index":"16821"},{"id":"45356","name":"国轩苑","index":"16821"},{"id":"45357","name":"合肥高校学生公寓小区","index":"16821"},{"id":"45358","name":"和谐家园（清溪路与长丰路交口）","index":"16821"},{"id":"45359","name":"琥珀北村","index":"16821"},{"id":"45360","name":"琥珀东村","index":"16821"},{"id":"45361","name":"琥珀公寓","index":"16821"},{"id":"45362","name":"琥珀花园村A区","index":"16821"},{"id":"45363","name":"琥珀南村","index":"16821"},{"id":"45364","name":"琥珀南村新华苑","index":"16821"},{"id":"45365","name":"琥珀中村","index":"16821"},{"id":"45366","name":"康居时代家园","index":"16821"},{"id":"45367","name":"康居苑小区","index":"16821"},{"id":"45368","name":"龙潭公寓","index":"16821"},{"id":"45369","name":"绿岛大厦","index":"16821"},{"id":"45370","name":"明珠苑","index":"16821"},{"id":"45371","name":"南山新村","index":"16821"},{"id":"45372","name":"省计委宿舍","index":"16821"},{"id":"45373","name":"盛华苑小区","index":"16821"},{"id":"45374","name":"蜀山新村","index":"16821"},{"id":"45375","name":"坛村","index":"16821"},{"id":"45376","name":"天合大院","index":"16821"},{"id":"45377","name":"铜锣湾广场","index":"16821"},{"id":"45378","name":"文园小区","index":"16821"},{"id":"45379","name":"怡园新村","index":"16821"},{"id":"45380","name":"邮电干休所","index":"16821"},{"id":"45381","name":"园林小区","index":"16821"},{"id":"45382","name":"长江小区","index":"16821"},{"id":"45434","name":"置地投资广场（长江西路）","index":"16821"},{"id":"45442","name":"旺城大厦","index":"16821"},{"id":"45443","name":"环球金融广场","index":"16821"},{"id":"45444","name":"鑫鹏大厦","index":"16821"},{"id":"45459","name":"安粮·兰桂公寓","index":"16821"},{"id":"45383","name":"安叉宿舍二村","index":"16822"},{"id":"45384","name":"安高城市天地","index":"16822"},{"id":"45385","name":"安高写字楼","index":"16822"},{"id":"45386","name":"安徽高速开元国际大酒店","index":"16822"},{"id":"45387","name":"安粮城市广场QQ公寓","index":"16822"},{"id":"45388","name":"安粮城市广场一期","index":"16822"},{"id":"45389","name":"百盛苑","index":"16822"},{"id":"45390","name":"叉车三村","index":"16822"},{"id":"45391","name":"朝阳大厦","index":"16822"},{"id":"45392","name":"朝阳小区","index":"16822"},{"id":"45393","name":"朝阳写字楼","index":"16822"},{"id":"45394","name":"安高城市天地","index":"16822"},{"id":"45395","name":"城市天地公寓","index":"16822"},{"id":"45396","name":"地方铁路家园","index":"16822"},{"id":"45397","name":"电科苑","index":"16822"},{"id":"45398","name":"锻压机床厂","index":"16822"},{"id":"45399","name":"合安大厦","index":"16822"},{"id":"45400","name":"合安花园","index":"16822"},{"id":"45401","name":"合叉总厂宿舍一村","index":"16822"},{"id":"45402","name":"合肥金融学校","index":"16822"},{"id":"45403","name":"合肥市第六十九中学","index":"16822"},{"id":"45404","name":"合肥市第六十七中学","index":"16822"},{"id":"45405","name":"合肥学院","index":"16822"},{"id":"45406","name":"合力职业技术学校","index":"16822"},{"id":"45407","name":"鸿基广场","index":"16822"},{"id":"45408","name":"华立大厦","index":"16822"},{"id":"45409","name":"黄金广场","index":"16822"},{"id":"45410","name":"机械研究所住宅区","index":"16822"},{"id":"45411","name":"建派小区","index":"16822"},{"id":"45412","name":"金湖新村","index":"16822"},{"id":"45413","name":"金梦大厦","index":"16822"},{"id":"45414","name":"科技苑","index":"16822"},{"id":"45415","name":"蓝郡","index":"16822"},{"id":"45416","name":"立基大厦","index":"16822"},{"id":"45417","name":"梅园居","index":"16822"},{"id":"45418","name":"美第阳光大厦","index":"16822"},{"id":"45419","name":"明星苑","index":"16822"},{"id":"45420","name":"明远新村","index":"16822"},{"id":"45421","name":"外运大厦","index":"16822"},{"id":"45422","name":"文馨园","index":"16822"},{"id":"45423","name":"西湖国际广场（望江路与肥西路交口）","index":"16822"},{"id":"45424","name":"新西南华庭","index":"16822"},{"id":"45425","name":"兴科大厦","index":"16822"},{"id":"45426","name":"印象西湖","index":"16822"},{"id":"45427","name":"永新大厦","index":"16822"},{"id":"45428","name":"中科大西校区","index":"16822"},{"id":"45429","name":"中科大中区","index":"16822"},{"id":"45430","name":"轴承南村","index":"16822"},{"id":"45431","name":"轴承新村","index":"16822"},{"id":"45432","name":"自由舱公寓","index":"16822"},{"id":"45193","name":"翠庭园小区","index":"16823"},{"id":"45194","name":"发能·太阳海岸","index":"16823"},{"id":"45195","name":"国际丽晶城","index":"16823"},{"id":"45196","name":"国建·香榭水都","index":"16823"},{"id":"45197","name":"恒润花园","index":"16823"},{"id":"45198","name":"湖畔春天","index":"16823"},{"id":"45199","name":"华润中心时与间","index":"16823"},{"id":"45200","name":"汇林阁东区","index":"16823"},{"id":"45201","name":"汇林阁西区","index":"16823"},{"id":"45202","name":"凯旋门","index":"16823"},{"id":"45203","name":"绿地·内森庄园","index":"16823"},{"id":"45204","name":"绿地花都·蓝蝶苑","index":"16823"},{"id":"45205","name":"明珠创世纪花园","index":"16823"},{"id":"45206","name":"浅水湾","index":"16823"},{"id":"45207","name":"融科九重锦","index":"16823"},{"id":"45208","name":"融侨天骏","index":"16823"},{"id":"45209","name":"瑞城岸上玫瑰","index":"16823"},{"id":"45210","name":"三盛颐景园","index":"16823"},{"id":"45211","name":"森林海","index":"16823"},{"id":"45212","name":"山水名城","index":"16823"},{"id":"45213","name":"书香苑","index":"16823"},{"id":"45214","name":"水墨兰庭","index":"16823"},{"id":"45215","name":"水墨兰庭北区","index":"16823"},{"id":"45216","name":"宋都西湖花苑","index":"16823"},{"id":"45217","name":"天鹅湖畔","index":"16823"},{"id":"45218","name":"天鹅湾花园","index":"16823"},{"id":"45219","name":"天和园","index":"16823"},{"id":"45220","name":"信达·水岸茗都","index":"16823"},{"id":"45221","name":"颐园世家","index":"16823"},{"id":"45222","name":"御龙湾","index":"16823"},{"id":"45223","name":"置地广场栢悦府","index":"16823"},{"id":"45224","name":"安德·兴业大厦","index":"16823"},{"id":"45225","name":"白天鹅国际商务中心","index":"16823"},{"id":"45226","name":"栢悦公馆","index":"16823"},{"id":"45227","name":"栢悦中心","index":"16823"},{"id":"45228","name":"宏源大厦","index":"16823"},{"id":"45229","name":"华润大厦","index":"16823"},{"id":"45230","name":"华润万象城","index":"16823"},{"id":"45231","name":"辉隆大厦","index":"16823"},{"id":"45232","name":"金潜广场","index":"16823"},{"id":"45233","name":"平安大厦","index":"16823"},{"id":"45234","name":"天鹅湖万达广场","index":"16823"},{"id":"45235","name":"新地中心","index":"16823"},{"id":"45236","name":"信德大厦","index":"16823"},{"id":"45237","name":"西湖国际广场（怀宁路和习友路交口）","index":"16823"},{"id":"45238","name":"振业大厦","index":"16823"},{"id":"45239","name":"置地广场","index":"16823"},{"id":"45240","name":"中辰国际广场","index":"16823"},{"id":"45289","name":"国贸天琴湾","index":"16823"},{"id":"45241","name":"八二一小区","index":"16824"},{"id":"45242","name":"丹青花园","index":"16824"},{"id":"45243","name":"国际花都玫瑰苑","index":"16824"},{"id":"45244","name":"国际花都天香苑","index":"16824"},{"id":"45245","name":"合作化南路社区","index":"16824"},{"id":"45246","name":"和谐家园（龙泉路与东至路交口）","index":"16824"},{"id":"45247","name":"湖东景园北区","index":"16824"},{"id":"45248","name":"湖东景园南区","index":"16824"},{"id":"45249","name":"湖畔徽映阁","index":"16824"},{"id":"45250","name":"华邦世贸城","index":"16824"},{"id":"45251","name":"徽映阁","index":"16824"},{"id":"45252","name":"嘉和苑北区","index":"16824"},{"id":"45253","name":"嘉和苑南区","index":"16824"},{"id":"45254","name":"金祁花园","index":"16824"},{"id":"45255","name":"金皖大院","index":"16824"},{"id":"45256","name":"近水阁小区","index":"16824"},{"id":"45257","name":"绿地雏菊苑","index":"16824"},{"id":"45258","name":"绿地丹若苑","index":"16824"},{"id":"45259","name":"绿地郁金苑","index":"16824"},{"id":"45260","name":"绿怡居东区","index":"16824"},{"id":"45261","name":"绿怡居西区","index":"16824"},{"id":"45262","name":"茗香苑","index":"16824"},{"id":"45263","name":"四方北村","index":"16824"},{"id":"45264","name":"四方西村","index":"16824"},{"id":"45265","name":"四方新村","index":"16824"},{"id":"45266","name":"陶然居","index":"16824"},{"id":"45267","name":"天鹅湖九号","index":"16824"},{"id":"45268","name":"天鹅湖一号","index":"16824"},{"id":"45269","name":"皖西新村","index":"16824"},{"id":"45270","name":"祥源-汇博名座","index":"16824"},{"id":"45271","name":"旭辉花园","index":"16824"},{"id":"45272","name":"亚华新城邦锦园","index":"16824"},{"id":"45273","name":"亚华新城邦-茗苑","index":"16824"},{"id":"45274","name":"亚华新城邦-雅轩","index":"16824"},{"id":"45275","name":"姚公庙新村","index":"16824"},{"id":"45276","name":"油库生活小区","index":"16824"},{"id":"45277","name":"中央宫园","index":"16824"},{"id":"45278","name":"自行车厂宿舍","index":"16824"},{"id":"45279","name":"百利广场","index":"16824"},{"id":"45280","name":"财智中心","index":"16824"},{"id":"45281","name":"琥珀五环城","index":"16824"},{"id":"45282","name":"绿地·蓝海国际大厦","index":"16824"},{"id":"45283","name":"天徽商业广场","index":"16824"},{"id":"45284","name":"天珑广场","index":"16824"},{"id":"45285","name":"蔚蓝商务港","index":"16824"},{"id":"45286","name":"新城国际","index":"16824"},{"id":"45287","name":"新城国际","index":"16824"},{"id":"45288","name":"常青花园","index":"16824"},{"id":"45457","name":"陶然居","index":"16824"},{"id":"45138","name":"丰盛华庭","index":"16825"},{"id":"45139","name":"宁溪家园","index":"16825"},{"id":"45140","name":"大溪地·天籁轩","index":"16825"},{"id":"45141","name":"大溪地·御倾城","index":"16825"},{"id":"45142","name":"大溪地·天悦轩","index":"16825"},{"id":"45143","name":"大溪地·天逸轩","index":"16825"},{"id":"45144","name":"大溪地·天润轩","index":"16825"},{"id":"45145","name":"大溪地悦溪公馆","index":"16825"},{"id":"45146","name":"经典雅苑","index":"16825"},{"id":"45147","name":"岳枫园","index":"16825"},{"id":"45148","name":"岳西新村","index":"16825"},{"id":"45149","name":"红旗机械厂生活区","index":"16825"},{"id":"45150","name":"正创西景苑","index":"16825"},{"id":"45151","name":"省医红会小区","index":"16825"},{"id":"45152","name":"岳西东村","index":"16825"},{"id":"45153","name":"丰乐世纪公寓","index":"16825"},{"id":"45154","name":"广利花园北区","index":"16825"},{"id":"45155","name":"汉嘉都市森林","index":"16825"},{"id":"45156","name":"潜龙山庄","index":"16825"},{"id":"45157","name":"动力新二村","index":"16825"},{"id":"45158","name":"动力东村","index":"16825"},{"id":"45159","name":"天柱园小区","index":"16825"},{"id":"45160","name":"清源新村","index":"16825"},{"id":"45162","name":"广利花园南区","index":"16825"},{"id":"45163","name":"新华U阁","index":"16825"},{"id":"45164","name":"北苑小区（贵池路）","index":"16825"},{"id":"45165","name":"名君家园","index":"16825"},{"id":"45166","name":"江南书苑","index":"16825"},{"id":"45167","name":"安居苑","index":"16825"},{"id":"45168","name":"安居苑西村","index":"16825"},{"id":"45169","name":"统计新村","index":"16825"},{"id":"45170","name":"辰元小区","index":"16825"},{"id":"45171","name":"金枫苑","index":"16825"},{"id":"45172","name":"虹桥苑","index":"16825"},{"id":"45173","name":"彩虹家园","index":"16825"},{"id":"45174","name":"邮电新村","index":"16825"},{"id":"45175","name":"平安家园","index":"16825"},{"id":"45176","name":"通和易居时代","index":"16825"},{"id":"45177","name":"通和易居同辉南苑","index":"16825"},{"id":"45178","name":"通和易居同辉北苑","index":"16825"},{"id":"45179","name":"长江花园","index":"16825"},{"id":"45180","name":"光明苑","index":"16825"},{"id":"45181","name":"天鹅花园","index":"16825"},{"id":"45182","name":"万科金域华府","index":"16825"},{"id":"45183","name":"众诚公寓","index":"16825"},{"id":"45184","name":"合肥牛奶公司宿舍区","index":"16825"},{"id":"45185","name":"液压件总厂生活区","index":"16825"},{"id":"45186","name":"领势公馆","index":"16825"},{"id":"45187","name":"金徽阳光100","index":"16825"},{"id":"45188","name":"二环新村","index":"16825"},{"id":"45189","name":"万盛苑","index":"16825"},{"id":"45190","name":"环东小区","index":"16825"},{"id":"45191","name":"环东小区北区","index":"16825"},{"id":"45192","name":"西环中心广场","index":"16825"},{"id":"45452","name":"金大地1912","index":"16825"},{"id":"45453","name":"摩尔广场","index":"16825"},{"id":"45454","name":"天睿大厦","index":"16825"},{"id":"45455","name":"BOSS中心","index":"16825"},{"id":"45456","name":"岳西东村","index":"16825"}]
     * sid : j485cjeht87rsl27c0ebi7r9i2
     * succeed : 1
     */

    private String sid;
    private int succeed;
    /**
     * id : 2229
     * name : 蜀山区
     * index : 186
     */

    private List<AreaBean> area;
    /**
     * id : 16816
     * name : 三里庵街道
     * index : 2229
     */

    private List<StreetBean> street;
    /**
     * id : 45290
     * name : 安徽大学
     * index : 16816
     */

    private List<ZoneBean> zone;

    public String getSid()
    {
        return sid;
    }

    public void setSid(String sid)
    {
        this.sid = sid;
    }

    public int getSucceed()
    {
        return succeed;
    }

    public void setSucceed(int succeed)
    {
        this.succeed = succeed;
    }

    public List<AreaBean> getArea()
    {
        return area;
    }

    public void setArea(List<AreaBean> area)
    {
        this.area = area;
    }

    public List<StreetBean> getStreet()
    {
        return street;
    }

    public void setStreet(List<StreetBean> street)
    {
        this.street = street;
    }

    public List<ZoneBean> getZone()
    {
        return zone;
    }

    public void setZone(List<ZoneBean> zone)
    {
        this.zone = zone;
    }

    public static class AreaBean
    {

        private String id;
        private String name;
        private String index;

        public String getId()
        {
            return id;
        }

        public void setId(String id)
        {
            this.id = id;
        }

        public String getName()
        {
            return name;
        }

        public void setName(String name)
        {
            this.name = name;
        }

        public String getIndex()
        {
            return index;
        }

        public void setIndex(String index)
        {
            this.index = index;
        }
    }

    public static class StreetBean
    {

        private String id;
        private String name;
        private String index;

        public String getId()
        {
            return id;
        }

        public void setId(String id)
        {
            this.id = id;
        }

        public String getName()
        {
            return name;
        }

        public void setName(String name)
        {
            this.name = name;
        }

        public String getIndex()
        {
            return index;
        }

        public void setIndex(String index)
        {
            this.index = index;
        }
    }

    public static class ZoneBean implements Serializable
    {

        private String id;
        private String name;
        private String index;

        public String getId()
        {
            return id;
        }

        public void setId(String id)
        {
            this.id = id;
        }

        public String getName()
        {
            return name;
        }

        public void setName(String name)
        {
            this.name = name;
        }

        public String getIndex()
        {
            return index;
        }

        public void setIndex(String index)
        {
            this.index = index;
        }
    }
}
